windTurbineCase_SimpleFoam/system/snappyHexMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}

castellatedMesh true;
snap            true;
addLayers       false;

geometry
{
    propeller
    {
        type triSurfaceMesh;
        file "propeller.stl";
    }

    cylinder
    {
        type triSurfaceMesh;
        file "cylinder.stl";
    }
}

castellatedMeshControls
{
    maxLocalCells       1000000;
    maxGlobalCells      5000000;
    minRefinementCells  10;
    nCellsBetweenLevels 3;

    locationInMesh (0.0 -1.0 0.0);

    features
    (
        {
            file "propeller.eMesh";
            level 2;
        }
        {
            file "cylinder.eMesh";
            level 1;
        }
    );

    refinementSurfaces
    {
        propeller
        {
            level (2 3);
            patchInfo
            {
                type wall;
            }
        }

        cylinder
        {
            level (1 1);

            faceZone    cylinder;
            cellZone    cylinder;
            cellZoneInside inside;
        }
    }

    refinementRegions
    {
        cylinder
        {
            mode inside;
            levels ((1E15 1));
        }
    }

    resolveFeatureAngle 30;
    allowFreeStandingZoneFaces true;
}

snapControls
{
    nSmoothPatch        3;
    tolerance           2.0;
    nSolveIter          30;
    nRelaxIter          5;
    nFeatureSnapIter    10;
    implicitFeatureSnap false;
    explicitFeatureSnap true;
    multiRegionFeatureSnap false;
}

addLayersControls
{
    relativeSizes true;

    layers
    {
        propeller
        {
            nSurfaceLayers 3;
        }
    }

    expansionRatio       1.2;
    finalLayerThickness  0.3;
    minThickness         0.1;
    nGrow                0;
    featureAngle         60;
    nRelaxIter           3;
    nSmoothSurfaceNormals 1;
    nSmoothNormals       3;
    nSmoothThickness     10;
    maxFaceThicknessRatio 0.5;
    maxThicknessToMedialRatio 0.3;
    minMedialAxisAngle   90;
    nBufferCellsNoExtrude 0;
    nLayerIter           50;
}

meshQualityControls
{
    maxNonOrtho         65;
    maxBoundarySkewness 20;
    maxInternalSkewness 4;
    maxConcave          80;
    minVol              1e-13;
    minTetQuality       1e-15;
    minArea             -1;
    minTwist            0.02;
    minDeterminant      0.001;
    minFaceWeight       0.05;
    minVolRatio         0.01;
    minTriangleTwist    -1;
    nSmoothScale        4;
    errorReduction      0.75;
}

writeFlags
(
    scalarLevels
    layerSets
    layerFields
);

mergeTolerance 1e-6;